driver-tests/cluster/InOutServiceCorrelationApp/test/TestCase2/Input.xml

<soapenv:Envelope
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:syn="http://xml.netbeans.org/schema/POSchema">
  <soapenv:Body>
    <syn:order id="1000">
      <syn:date>2008-09-28</syn:date>
      <syn:customer>
        <syn:firstname>John</syn:firstname>
        <syn:lastname>Doe</syn:lastname>
      </syn:customer>
      <syn:item>
        <syn:name>item1</syn:name>
        <syn:qty>5</syn:qty>
        <syn:price>100</syn:price>
      </syn:item>
      <syn:item>
        <syn:name>item2</syn:name>
        <syn:qty>10</syn:qty>
        <syn:price>100</syn:price>
      </syn:item>
      <syn:item>
        <syn:name>item3</syn:name>
        <syn:qty>8</syn:qty>
        <syn:price>115</syn:price>
      </syn:item>
      <syn:item>
        <syn:name>item2</syn:name>
        <syn:qty>3</syn:qty>
        <syn:price>200</syn:price>
      </syn:item>
    </syn:order>
  </soapenv:Body>
</soapenv:Envelope>