driver-tests/cluster/InOutServiceApp/test/TestCase1/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <syn:order xmlns:msgns="http://j2ee.netbeans.org/wsdl/InOutService/calcPOTotalValue" xmlns:syn="http://xml.netbeans.org/schema/POSchema" id="1000">
      <syn:date>2008-09-28</syn:date>
      <syn:totalValue>3020.0</syn:totalValue>
      <syn:customer>
        <syn:firstname>John</syn:firstname>
        <syn:lastname>Doe</syn:lastname>
      </syn:customer>
      <syn:item>
        <syn:name>item1</syn:name>
        <syn:qty>5</syn:qty>
        <syn:price>100</syn:price>
      </syn:item>
      <syn:item>
        <syn:name>item2</syn:name>
        <syn:qty>10</syn:qty>
        <syn:price>100</syn:price>
      </syn:item>
      <syn:item>
        <syn:name>item3</syn:name>
        <syn:qty>8</syn:qty>
        <syn:price>115</syn:price>
      </syn:item>
      <syn:item>
        <syn:name>item2</syn:name>
        <syn:qty>3</syn:qty>
        <syn:price>200</syn:price>
      </syn:item>
    </syn:order>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
